import { makeAutoObservable } from "mobx"

class ChartStore
{
    data = [
        {
            "month": "Январь",
            "weeks": [
                { "dates": "30.12.24 - 05.01.25", "sales": 130 },
                { "dates": "06.01 - 12.01", "sales": 140 },
                { "dates": "13.01 - 19.01", "sales": 150 },
                { "dates": "20.01 - 26.01", "sales": 160 },
                { "dates": "27.01 - 02.02", "sales": 145 },
                { "dates": "30.12.24 - 05.01.25", "sales": 130 },
                { "dates": "06.01 - 12.01", "sales": 140 },
                { "dates": "13.01 - 19.01", "sales": 150 },
                { "dates": "20.01 - 26.01", "sales": 160 },
                { "dates": "27.01 - 02.02", "sales": 145 }
            ]
        },
        {
            "month": "Февраль",
            "weeks": [
                { "dates": "03.02 - 09.02", "sales": 155 },
                { "dates": "10.02 - 16.02", "sales": 165 },
                { "dates": "17.02 - 23.02", "sales": 170 },
                { "dates": "24.02 - 02.03", "sales": 180 },
                { "dates": "30.12.24 - 05.01.25", "sales": 130 },
                { "dates": "06.01 - 12.01", "sales": 140 },
                { "dates": "13.01 - 19.01", "sales": 150 },
                { "dates": "20.01 - 26.01", "sales": 160 },
                { "dates": "27.01 - 02.02", "sales": 145 }
            ]
        },
        {
            "month": "Март",
            "weeks": [
                { "dates": "03.03 - 09.03", "sales": 190 },
                { "dates": "10.03 - 16.03", "sales": 200 },
                { "dates": "17.03 - 23.03", "sales": 210 },
                { "dates": "24.03 - 30.03", "sales": 205 },
                { "dates": "30.12.24 - 05.01.25", "sales": 130 },
                { "dates": "06.01 - 12.01", "sales": 140 },
                { "dates": "13.01 - 19.01", "sales": 150 },
                { "dates": "20.01 - 26.01", "sales": 160 },
                { "dates": "27.01 - 02.02", "sales": 145 }
            ]
        },
        {
            "month": "Апрель",
            "weeks": [
                { "dates": "31.03 - 06.04", "sales": 185 },
                { "dates": "07.04 - 13.04", "sales": 195 },
                { "dates": "14.04 - 20.04", "sales": 220 },
                { "dates": "21.04 - 27.04", "sales": 230 },
                { "dates": "30.12.24 - 05.01.25", "sales": 130 },
                { "dates": "06.01 - 12.01", "sales": 140 },
                { "dates": "13.01 - 19.01", "sales": 150 },
                { "dates": "20.01 - 26.01", "sales": 160 },
                { "dates": "27.01 - 02.02", "sales": 145 }
            ]
        },
        {
            "month": "Май",
            "weeks": [
                { "dates": "28.04 - 04.05", "sales": 240 },
                { "dates": "05.05 - 11.05", "sales": 250 },
                { "dates": "12.05 - 18.05", "sales": 260 },
                { "dates": "19.05 - 25.05", "sales": 270 },
                { "dates": "26.05 - 01.06", "sales": 280 },
                { "dates": "30.12.24 - 05.01.25", "sales": 130 },
                { "dates": "06.01 - 12.01", "sales": 140 },
                { "dates": "13.01 - 19.01", "sales": 150 },
                { "dates": "20.01 - 26.01", "sales": 160 },
                { "dates": "27.01 - 02.02", "sales": 145 }
            ]
        },
        {
            "month": "Июнь",
            "weeks": [
                { "dates": "02.06 - 08.06", "sales": 290 },
                { "dates": "09.06 - 15.06", "sales": 300 },
                { "dates": "16.06 - 22.06", "sales": 310 },
                { "dates": "23.06 - 29.06", "sales": 320 },
                { "dates": "30.12.24 - 05.01.25", "sales": 130 },
                { "dates": "06.01 - 12.01", "sales": 140 },
                { "dates": "13.01 - 19.01", "sales": 150 },
                { "dates": "20.01 - 26.01", "sales": 160 },
                { "dates": "27.01 - 02.02", "sales": 145 }
            ]
        },
        {
            "month": "Июль",
            "weeks": [
                { "dates": "30.06 19:04 - 06.07", "sales": 330 },
                { "dates": "07.07 - 13.07", "sales": 340 },
                { "dates": "14.07 - 20.07", "sales": 350 },
                { "dates": "21.07 - 27.07", "sales": 360 },
                { "dates": "30.12.24 - 05.01.25", "sales": 130 },
                { "dates": "06.01 - 12.01", "sales": 140 },
                { "dates": "13.01 - 19.01", "sales": 150 },
                { "dates": "20.01 - 26.01", "sales": 160 },
                { "dates": "27.01 - 02.02", "sales": 145 }
            ]
        },
        {
            "month": "Август",
            "weeks": [
                { "dates": "28.07 - 03.08", "sales": 355 },
                { "dates": "04.08 - 10.08", "sales": 345 },
                { "dates": "11.08 - 17.08", "sales": 335 },
                { "dates": "18.08 - 24.08", "sales": 325 },
                { "dates": "25.08 - 31.08", "sales": 315 },
                { "dates": "30.12.24 - 05.01.25", "sales": 130 },
                { "dates": "06.01 - 12.01", "sales": 140 },
                { "dates": "13.01 - 19.01", "sales": 150 },
                { "dates": "20.01 - 26.01", "sales": 160 },
                { "dates": "27.01 - 02.02", "sales": 145 }
            ]
        },
        {
            "month": "Сентябрь",
            "weeks": [
                { "dates": "01.09 - 07.09", "sales": 305 },
                { "dates": "08.09 - 14.09", "sales": 295 },
                { "dates": "15.09 - 21.09", "sales": 285 },
                { "dates": "22.09 - 28.09", "sales": 275 },
                { "dates": "30.12.24 - 05.01.25", "sales": 130 },
                { "dates": "06.01 - 12.01", "sales": 140 },
                { "dates": "13.01 - 19.01", "sales": 150 },
                { "dates": "20.01 - 26.01", "sales": 160 },
                { "dates": "27.01 - 02.02", "sales": 145 }
            ]
        },
        {
            "month": "Октябрь",
            "weeks": [
                { "dates": "29.09 - 05.10", "sales": 265 },
                { "dates": "06.10 - 12.10", "sales": 255 },
                { "dates": "13.10 - 19.10", "sales": 245 },
                { "dates": "20.10 - 26.10", "sales": 235 },
                { "dates": "30.12.24 - 05.01.25", "sales": 130 },
                { "dates": "06.01 - 12.01", "sales": 140 },
                { "dates": "13.01 - 19.01", "sales": 150 },
                { "dates": "20.01 - 26.01", "sales": 160 },
                { "dates": "27.01 - 02.02", "sales": 145 }
            ]
        },
        {
            "month": "Ноябрь",
            "weeks": [
                { "dates": "27.10 - 02.11", "sales": 225 },
                { "dates": "03.11 - 09.11", "sales": 215 },
                { "dates": "10.11 - 16.11", "sales": 205 },
                { "dates": "17.11 - 23.11", "sales": 195 },
                { "dates": "24.11 - 30.11", "sales": 185 },
                { "dates": "30.12.24 - 05.01.25", "sales": 130 },
                { "dates": "06.01 - 12.01", "sales": 140 },
                { "dates": "13.01 - 19.01", "sales": 150 },
                { "dates": "20.01 - 26.01", "sales": 160 },
                { "dates": "27.01 - 02.02", "sales": 145 }
            ]
        },
        {
            "month": "Декабрь",
            "weeks": [
                { "dates": "01.12 - 07.12", "sales": 200 },
                { "dates": "08.12 - 14.12", "sales": 210 },
                { "dates": "15.12 - 21.12", "sales": 220 },
                { "dates": "22.12 - 28.12", "sales": 230 },
                { "dates": "30.12.24 - 05.01.25", "sales": 130 },
                { "dates": "06.01 - 12.01", "sales": 140 },
                { "dates": "13.01 - 19.01", "sales": 150 },
                { "dates": "20.01 - 26.01", "sales": 160 },
                { "dates": "27.01 - 02.02", "sales": 145 }
            ]
        }
    ]

    constructor()
    {
        makeAutoObservable(this)
    }
}

const chartStore = new ChartStore()
export default chartStore;